  var alphabetR = ["ё", "я", "ю", "э", "ь", "ы", "ъ", "щ", "ш", "ч", "ц", "х", "ф", "у", "т", "с", "р", "П", "О", "Н", "М", "Л", "К", "Й", "И", "З", "Ж", "Е", "Д", "Г", "В", "Б", "А", ];
  var alphabet = ["А", "Б", "В", "Г", "Д", "Е", "Ж", "З", "И", "Й", "К", "Л", "М", "Н", "О", "П", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь", "э", "ю", "я", "ё", ];
  alphabetR.sort();
  var result = true;
  for(var i = 0;i < 26;i++)
  {
    if (alphabetR[i] !== alphabet[i])
      result = false;
  }
  {
    var __result1 = result !== true;
    var __expect1 = false;
  }
  